<a href="https://colab.research.google.com/github/Gayathri-328/gayathri/blob/main/employee.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd

df = pd.read_excel( '/content/drive/MyDrive/Employee_Details.xlsx'  )
df.head()
print(df)

  Employee ID           Name          Place  Age    Salary     Qualification  \
0      EMP001  Alice Johnson       New York   29   $75,000        Bachelor's
1      EMP002      Bob Smith        Chicago   34   $85,000          Master's
2      EMP003      Carol Lee  San Francisco   28   $95,000               PhD
3      EMP004      David Kim        Seattle   40  $120,000        Bachelor's
4      EMP005      Eva Brown         Austin   31   $70,000          Master's
5      EMP006    Frank Green         Boston   45   $65,000  Associate Degree
6      EMP007    Grace White         Denver   27   $78,000        Bachelor's
7      EMP008    Harry Black          Miami   37   $90,000          Master's
8      EMP009    Irene Scott         Dallas   32  $110,000               MBA
9      EMP010    Jack Harris        Phoenix   25   $60,000        Bachelor's

            Position
0  Software Engineer
1       Data Analyst
2   Machine Learning
3    Project Manager
4        UX Designer
5  Technical Support
6     Marketing Lead
7         HR Manager
8   Business Analyst
9   Junior Developer

In [ ]:
print("first few rows")
print(df.head())

first few rows
  Employee ID           Name          Place  Age    Salary Qualification  \
0      EMP001  Alice Johnson       New York   29   $75,000    Bachelor's
1      EMP002      Bob Smith        Chicago   34   $85,000      Master's
2      EMP003      Carol Lee  San Francisco   28   $95,000           PhD
3      EMP004      David Kim        Seattle   40  $120,000    Bachelor's
4      EMP005      Eva Brown         Austin   31   $70,000      Master's

            Position
0  Software Engineer
1       Data Analyst
2   Machine Learning
3    Project Manager
4        UX Designer

In [ ]:
print("\n summary statistics:")
print(df.describe())

 summary statistics:
             Age
count  10.000000
mean   32.800000
std     6.285786
min    25.000000
25%    28.250000
50%    31.500000
75%    36.250000
max    45.000000

In [ ]:
filtered_data=df[df['Age']>30]
print("\n filtered data(Age>30):")
print(filtered_data)

 filtered data(Age>30):
  Employee ID         Name    Place  Age    Salary     Qualification  \
1      EMP002    Bob Smith  Chicago   34   $85,000          Master's
3      EMP004    David Kim  Seattle   40  $120,000        Bachelor's
4      EMP005    Eva Brown   Austin   31   $70,000          Master's
5      EMP006  Frank Green   Boston   45   $65,000  Associate Degree
7      EMP008  Harry Black    Miami   37   $90,000          Master's
8      EMP009  Irene Scott   Dallas   32  $110,000               MBA

            Position
1       Data Analyst
3    Project Manager
4        UX Designer
5  Technical Support
7         HR Manager
8   Business Analyst

In [ ]:
filtered_data = df[df["Age"] > 30]
print(filtered_data)

  Employee ID         Name    Place  Age    Salary     Qualification  \
1      EMP002    Bob Smith  Chicago   34   $85,000          Master's
3      EMP004    David Kim  Seattle   40  $120,000        Bachelor's
4      EMP005    Eva Brown   Austin   31   $70,000          Master's
5      EMP006  Frank Green   Boston   45   $65,000  Associate Degree
7      EMP008  Harry Black    Miami   37   $90,000          Master's
8      EMP009  Irene Scott   Dallas   32  $110,000               MBA

            Position
1       Data Analyst
3    Project Manager
4        UX Designer
5  Technical Support
7         HR Manager
8   Business Analyst

In [ ]:
Sorted_data=df.sort_values(by='Salary',ascending=False)
print("\n sorted data(by Salary):")
print(Sorted_data)

 sorted data(by Salary):
  Employee ID           Name          Place  Age    Salary     Qualification  \
2      EMP003      Carol Lee  San Francisco   28   $95,000               PhD
7      EMP008    Harry Black          Miami   37   $90,000          Master's
1      EMP002      Bob Smith        Chicago   34   $85,000          Master's
6      EMP007    Grace White         Denver   27   $78,000        Bachelor's
0      EMP001  Alice Johnson       New York   29   $75,000        Bachelor's
4      EMP005      Eva Brown         Austin   31   $70,000          Master's
5      EMP006    Frank Green         Boston   45   $65,000  Associate Degree
9      EMP010    Jack Harris        Phoenix   25   $60,000        Bachelor's
3      EMP004      David Kim        Seattle   40  $120,000        Bachelor's
8      EMP009    Irene Scott         Dallas   32  $110,000               MBA

            Position
2   Machine Learning
7         HR Manager
1       Data Analyst
6     Marketing Lead
0  Software Engineer
4        UX Designer
5  Technical Support
9   Junior Developer
3    Project Manager
8   Business Analyst

In [ ]:
df.to_excel('output.xlsx',index=False)
print("\n Data written to output.xlsx")

 Data written to output.xlsx